Revit 2024 API
ExternalResourceReference.Version Property
 The version of the external data that was most recently loaded in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string Version { get; internal set; }
Visual Basic
Public Property Version As String
	Get
	Friend Set
Visual C++
public:
property String^ Version {
	String^ get ();
	internal: void set (String^ value);
}
See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace